Repository: iiislambekkk/Talapker
Catalog: src/Talapker.Infrastructure/Resources/SharedResource.*.resx
Languages: kk

source: Welcome
kk: Қош келдіңіз!

source: Register
kk: Тіркелу

source: Log in
kk: Кіру

# LocalAccToLogin
source: Use a local account to log in
kk: Жүйеге кіру үшін жергілікті аккаунтыныздыі пайдаланыңыз

source: Email
kk: Пошта

source: Password
kk: Құпия сөз

source: Remember me?
kk: Кіруді есте сақтау керекпе?

source: Forgot Password
kk: Құпия сөзді ұмыттыңызба?

# EmailRequired
source: The Email field is required.
kk: Поштаны жазу міндетті.

# InvalidEmail
source: The Email field is not a valid e-mail address.
kk: Пошта өрісі жарамды электрондық пошта мекенжайы емес.

# PasswordRequired
source: The Password field is required.
kk: Құпия сөз өрісі толтырылуы міндетті.

# EnterEmail
source: Enter your email
kk: Поштаңызды жазыңыз

source: Reset Password
kk: Құпия сөзді қалпына келтіру

source: Forgot password confirmation
kk: Құпия сөзді ұмытуды растау

# CheckEmailPassword
source: Please check your email to reset your password.
kk: Құпия сөзді қалпына келтіру үшін электрондық поштаңызды тексеріңіз.

source: Hello
kk: Сәлем

# TwoFactorAuth
source: Two-factor authentication
kk: Екі факторлы аутентификация

source: PersonalData
kk: Жеке ақпарат

# ManageAccount
source: Manage your account
kk: Жеке ақпаратты басқару

# ChangeSettings
source: Change your account settings
kk: Аккаунт параметрлерін өзгертіңіз

source: Last Name
kk: Фамилия

source: First Name
kk: Есім

# ProfileUpdated
source: Your profile has been updated
kk: Сіздің профиліңіз жаңартылды

source: Manage Email
kk: Поштаны басқару

source: New email
kk: Жаңа пошта

source: Change email
kk: Поштаны өзгерту

source: Current Password
kk: Қазіргі кұпия сөз

# EnterOldPassword
source: Please enter your old password.
kk: Ескі парольді енгізіңіз.

# EnterNewPassword
source: Please enter your new password.
kk: Жаңа құпия сөзді енгізіңіз.

source: Confirm New Password
kk: Жаңа құпия сөзді қайттан теріңіз

source: Update Password
kk: Құпия сөзді өзгерту

source: Profile
kk: Профиль

# PersonalDataDesc
source: Your account contains personal data that you have given us. This page allows you to download or delete that data.
kk: Сіздің есептік жазбаңызда сіз бізге берген жеке деректер бар. Бұл бет сол деректерді жүктеп алуға немесе жоюға мүмкіндік береді.

# DeletePersonalData
source: Deleting this data will permanently remove your account, and this cannot be recovered.
kk: Бұл деректерді жою сіздің есептік жазбаңызды біржола жояды және оны қалпына келтіру мүмкін емес.

source: Enter new email
kk: Жаңа поштаңызды жазыңыз

# PasswordsNotMatch
source: The new password and confirmation password do not match.
kk: Жаңа пароль мен растау паролі сәйкес келмейді.

source: New password
kk: Жаңа құпия сөз

# ConfirmPass
source: Confirm new password
kk: Жаңа құпия сөзді растау

# PasswordLength
source: The New password must be at least 6 and at max 100 characters long.
kk: Жаңа құпия сөз кемінде 6 және ең көбі 100 таңбадан тұруы керек.

# DidntFindAccToExProvider
source: We have not found a valid account linked to your external account
kk: Біз сіздің сыртқы есептік жазбаңызға байланысты жарамды есептік жазбаны таппадық

# LinkExProvider
source: . If you haven't linked an external login service yet, you can do so in your profile settings after logging in with a password.
kk: . Егер сіз сыртқы кіру қызметін әлі байланыстырмаған болсаңыз, оны құпия сөз арқылы кіргеннен кейін профиль параметрлерінде байланыстыра аласыз.

# ExternalProvider
source: Use another service to log in.
kk: Сыртқы сервис арқылы кіру.

# 2faProtected
source: Your login is protected with an authenticator app. Enter your authenticator code below.
kk: Сіздің логиніңіз аутентификатор қолданбасымен қорғалған. Төменде аутентификатор кодын енгізіңіз.

# 2fa
source: Two-factor authentication
kk: Екі факторлы аутентификация

# RememberMachine
source: Remember this machine
kk: Бұл құрылғыны есте сақтаңыз

# Forget2fa
source: Don't have access to your authenticator device? You can
kk: Аутентификатор құрылғысына кіру мүмкіндігіңіз жоқ па? Сіз

# RecoveryCode
source: log in with a recovery code
kk: қалпына келтіру кодымен жүйеге кіре аласыз

# AuthCode
source: Authenticator code
kk: Аутентификатор коды

source: Registered Logins
kk: Байланыстырылған сыртқы сервистер

# ManageExternalLogins
source: Manage your external logins
kk: Сыртқы логиндерді басқарыңыз

source: Remove
kk: Байланысты жою

# AddExProvider
source: Add another service to log in.
kk: Жүйеге кіру үшін жаңа сыртқы сервисті байлаңыстыру.

source: Logout
kk: Аккаунттаң шығу

# GoBackToPortal
source: Go back to the portal
kk: Порталға оралу

source: Email or login
kk: Электрондық пошта немесе логин

source: Email or login required
kk: Электрондық пошта немесе логин толтырылуы міндетті

# UniversityWithSameCodeAlreadyExists
source: University with code:{0} already exists.
kk: Коды бар университет: {0} бұрыннан бар.

source: Reset Your Password
kk: Құпия сөзіңізді қалпына келтіру

# ResetPasswordDescription
source: Enter your email and we'll send you a link to reset your password
kk: Электрондық поштаңызды енгізіңіз, біз сізге құпия сөзді қалпына келтіру сілтемесін жібереміз

# EnterEmailToReset
source: Enter your email to reset your password
kk: Құпия сөзді қалпына келтіру үшін email енгізіңіз

source: Email Address
kk: Электрондық пошта

# EnterYourEmail
source: Enter your email address
kk: Электрондық поштаңызды енгізіңіз

# RememberPassword
source: Remember your password?
kk: Құпия сөзді еске түсірдіңіз бе?

source: Sign in
kk: Кіру

source: Need help?
kk: Көмек керек пе?

source: Contact support
kk: Қолдау қызметіне хабарласыңыз

source: Two-Factor Authentication
kk: Екі факторлы аутентификация
